In [1]:
from impala.dbapi import connect
from impala.util import as_pandas
import pandas as pd

In [112]:
conn = connect(host='133.186.168.6', port=21050)
cursor = conn.cursor()

In [23]:
cursor.execute("SELECT * FROM MWS_COLT_ITEM_IVT LIMIT 1")

In [24]:
tmp = as_pandas(cursor)

In [25]:
tmp

,id,item_id,stock_id,stock_amount,add_price,collect_day,reg_id,reg_dt
0,2335883412,5052433,27963814005,20,0,20171231,SERVER,2018-01-01 00:00:00

In [13]:
tmp.item_id.unique()[:10]

array(['5951500', '5257497', '681669', '5951501', '293124', '2889643',
       '5257500', '291817', '5951502', '289313'], dtype=object)

In [49]:
cursor.execute("SELECT * FROM MWS_COLT_ITEM_IVT WHERE item_id IN ('627208', '5257497', '293124' )")

In [50]:
tmpp = as_pandas(cursor)

In [59]:
from util import *
from time import gmtime, strftime
from pytz import timezone
from datetime import datetime
from sqlalchemy import ForeignKey, Table, Column, String, Integer, Float, Boolean, MetaData, select
from joblib import Parallel, delayed

epopcon_db = Epopcon_db()

wspider_engine = epopcon_db.get_engine(production=True)
wspider_temp_engine = epopcon_db.get_engine(production=False)

ids_df = pd.read_sql_query("SELECT ID FROM MWS_COLT_ITEM WHERE RELEASE_DT > '2018-01-01'", wspider_engine)

DENOM = 500
item_ids = ids_df.ID.values
n_batches = math.ceil( len(item_ids) / float(DENOM))

In [65]:
item_ids = ids_df.ID.values.astype(str)

In [71]:
batch_ls = [str(tuple(batch)) for batch in np.array_split(item_ids, n_batches)]
batch_lst = [(idx, str(row)) for idx, row in enumerate(batch_ls)]

In [113]:
query = "SELECT * FROM MWS_COLT_ITEM_IVT WHERE item_id IN ('6741169')"

In [126]:
%%time
query = "SELECT * FROM MWS_COLT_ITEM_IVT WHERE item_id IN %s" % batch_lst[3][1]

cursor.execute(query)

tmppp = as_pandas(cursor)

               id  item_id     stock_id stock_amount add_price collect_day  reg_id               reg_dt
0      2374232564  6741168  28993135001           99         0    20180105  SERVER  2018-01-05 20:59:53
1      2374232565  6741169  28993122001          999         0    20180105  SERVER  2018-01-05 20:59:53
2      2374232566  6741170  28993131001          999         0    20180105  SERVER  2018-01-05 20:59:53
3      2374232567  6741171  28993141001           10         0    20180105  SERVER  2018-01-05 20:59:53
4      2374232568  6741174  28993177001           10         0    20180105  SERVER  2018-01-05 20:59:53
...           ...      ...          ...          ...       ...         ...     ...                  ...
83325  3163064190  6741631  28993810001            3         0    20180304  SERVER  2018-03-04 20:54:11
83326  3163082843  6741629  28992818001           20         0    20180304  SERVER  2018-03-04 20:57:55
83327  3163098327  6741628  28992813001           20         0    20180304  SERVER  2018-03-04 20:59:46
83328  3163108773  6741652  28971853001            1         0    20180304  SERVER  2018-03-04 21:01:53
83329  3163123514  6741623  28991956001           30         0    20180304  SERVER  2018-03-04 21:04:59

[83330 rows x 8 columns]

In [133]:
start_time = time.time()
query = "SELECT * FROM MWS_COLT_ITEM_IVT WHERE item_id IN %s" % batch_lst[8][1]

cursor.execute(query)

tmppp = as_pandas(cursor)
elapsed_time = time.time() - start_time

In [134]:
elapsed_time

6.746815204620361